---
kind: other
id: Methods.T:Autodesk.Revit.DB.Electrical.ConduitSizeSettingIterator
source: html/1aa2f4bf-3163-75f0-055f-767837f141bc.htm
---
# ConduitSizeSettingIterator Methods

Identifies whether the iterator has a current item.
 There is no current item if the iterator has not started yet or has been done.